// import groom from "../assets/ZEFAAF AVATAR NEW .png";

const Conditions = () => {
  return (
    <section className="py-12 mt-[140px]  bg-[#5650ce]">
      <div className="container mx-auto px-4 max-md:px-2">
        <h2 className="text-4xl font-bold text-center mb-8">الشروط والأحكام</h2>

        <div className="bg-[#6610f2] flex items-center bg_image  justify-center p-8 rounded-lg shadow-lg">
          <div className="w-[100%]  max-md:w-full">
            <h4 className="text-[white] text-center mb-5 h-[50px] text-xl font-bold">
              الهيئة الشرعية بمنصة زفاف
            </h4>
            <p>
              تُهيب بجميع الأعضاء الراغبين في إنشاء حساب على منصة زفاف أن يقرأوا
              الشروط والأحكام جيداً قبل استخدام المنصة، حيث إن هذه الشروط
              والأحكام مُلزمة لجميع الأعضاء سواء أصحاب الباقات المجانية أو
              المدفوعة. كما يحق لمنصة زفاف إجراء أي تعديل على تلك الشروط
              والأحكام في أي وقت، لذا وجب على الأعضاء الاطلاع عليها بين الحين
              والآخر.
            </p>

            <p className="text-gray-300 font-medium pt-4 mb-4">
              شروط خاصة بمنصة زفاف:
            </p>
            <ul className="list-disc px-4 mb-6 flex flex-col gap-4 text-lg text-white">
              <li>يجب أن يكون المشترك مسلماً بالغاً مؤهلاً للزواج.</li>
              <li>يجب أن تقوم الفتاة بالتسجيل بمعرفة أوليائها ومحارمها.</li>
              <li>
                يُمنع منعاً باتاً تحويل أموال لأي عضو تحت أي مبرر، فجميعها
                مبررات كاذبة، فاحذر.
              </li>
              <li>
                هدف المنصة هو التخطيط للزواج بأخلاق إسلامية، وليس لأي غرض آخر
                مثل التعارف أو الصداقة. كما لا نقبل التسجيل بغرض زواج المتعة، أو
                الزواج المؤقت، أو الزواج العرفي، فكل هذه المسميات باطلة شرعاً
                وقانوناً ولا نسمح بها.
              </li>
              <li>
                يجب أن يكون اسم المستخدم الخاص بالعضو لائقاً ومحترماً ومناسباً
                لطبيعة هذه المنصة الشرعية. كما يُمنع منعاً باتاً استخدام أسماء
                هزلية أو إباحية.
              </li>
              <li>
                يُمنع إدخال البريد الإلكتروني أو رقم الهاتف ضمن اسم المستخدم أو
                البيانات الشخصية.
              </li>
              <li>
                يُمنع منعاً باتاً استغلال المنصة لأغراض تجارية أو إعلانية بأي
                صورة كانت.
              </li>
              <li>
                يحق للشاب والفتاة امتلاك حساب واحد فقط فعال، ولا يجوز التسجيل
                لأكثر من عضوية للشخص نفسه.
              </li>
              <li>
                في منصة زفاف، نحن غير مسؤولين عن صحة بيانات الأعضاء، كما أن
                المنصة غير مسؤولة عن عمليات النصب والاحتيال، لكننا نراقب عن كثب
                ما يتم كتابته في ملفات الأعضاء عند التسجيل، وفي حال الشك في أي
                معلومة وهمية نقوم بإزالتها فوراً. لذا وجب أخذ الحيطة والحذر
                والامتثال لتحذيرات المنصة المستمرة.
              </li>
              <li>
                يُمنع استخدام العضوية في المنصة بهدف التشهير أو الإساءة لأي شخص.
              </li>

              <li>يحق للأعضاء حذف عضويتهم في أي وقت.</li>
              <li>
                يحق لمنصة زفاف إلغاء عضوية أي مستخدم دون الرجوع إليه إذا خالف
                الشروط والأحكام، التي وافق عليها عند التسجيل، ولا يحق له استرداد
                أي مبالغ قد دفعها.
              </li>
              <li>
                مخالفة جميع الشروط والأحكام السابقة تعرض عضوية المخالف للحظر،
                فانتبه.
              </li>
            </ul>
            <p className="text-gray-300 font-medium pt-4 mb-4">
              شروط التواصل بين الأعضاء:
            </p>
            <ul className="list-disc px-4 mb-6 flex flex-col gap-4 text-lg text-white">
              <li>
                التسجيل مجاني ومفتوح للجميع، لكن يجب أن تعلم الفتاة، سواء كانت
                شابة صغيرة أو امرأة كبيرة، أنه لا يجوز لها التسجيل مطلقاً دون
                علم أوليائها. ومن تخالف ذلك فإنها تخالف الشروط والأحكام التي
                قامت عليها المنصة، وتكون قد حنثت بالقسم الذي أقسمته عند التسجيل،
                ويحق للمنصة طردها وحظرها على الفور.
              </li>

              <li>
                احتراماً لمبدأ الشفافية الذي تعهدت به منصة زفاف لمستخدميها،
                نخبرك أنه بمجرد تسجيل العضو لحسابه، فإنه يوافق على أن تقوم منصة
                زفاف بعرض رقم هاتفه لمن ترى في بياناته الجدية.
              </li>
              <li>
                وبما أن هدف المنصة هو إيصال الشريكين ببعضهما البعض وكسر الطرق
                التقليدية في التواصل والتعارف بطرق حديثة وإسلامية، وليس أن يبقى
                الأعضاء على المنصة لشهور في تعارف ممل، فقد وفرنا خدمة إظهار رقم
                الهاتف حتى يتمكن الشاب من التواصل مع أولياء المرأة، وتحديد موعد
                للرؤية الشرعية، ثم ندخل البيوت من أبوابها كما أمرنا الله.
              </li>
              <li>
                يتم التواصل بين الأعضاء عبر المحادثات الداخلية أولاً، والتي
                صممناها بتكنولوجيا عصرية وملصقات جذابة وإسلامية.
              </li>
              <li>
                يُمنع طلب أي وسيلة أخرى من وسائل التواصل قبل التعارف وحدوث
                التوافق بين العضو وأولياء العروس. كما يُمنع استخدام أية عبارات
                أو ألفاظ خادشة للحياء.
              </li>
              <li>
                يُمنع منعاً باتاً تبادل المعلومات والبيانات الخاصة بالأعضاء. كما
                يُمنع الاشتراك في عضوية ومشاركة مميزاتها مع آخرين، فهذا سيعرض
                حسابك للحظر فوراً وحرمانك من التسجيل مستقبلاً.
              </li>
              <li>
                على جميع المستخدمين الالتزام بالأخلاق الإسلامية والقيم المجتمعية
                في مراسلاتهم الداخلية.
              </li>
            </ul>

            <p className="text-gray-300 font-medium pt-4 mb-4">
              شروط السداد والاسترجاع:
            </p>
            <ul>
              <li>
                1 . لا يحق للعضو المشترك في الخدمة المدفوعة مخالفة الشروط
                والأحكام، فجميع ما يُطبق من مخالفات على أصحاب الباقات المجانية
                يُطبق كذلك على أصحاب الباقات المدفوعة دون تمييز.
              </li>
              <li>
                2 . في حال شراء العضو للباقة المدفوعة وتم تفعيلها، حتى لو لدقائق
                معدودة، فلا يحق له المطالبة باسترجاع قيمتها. كما أنه في حال
                ارتكابه أية مخالفة مع الأعضاء وتم حظر حسابه، لا يحق له استرداد
                المبلغ المتبقي من اشتراكه.
              </li>

              <p className="text-gray-300 font-medium pt-4 mb-4">
                كل ما هو موجود على المنصة، سواء بالموقع أو التطبيق، ووسائل
                التواصل الخاصة بمنصة زفاف من تصميمات ومواد ومحتوى، هو ملك تام
                لمنصة زفاف، ولا يحق للغير استغلالها دون موافقة مسبقة من الإدارة.
              </p>

              <p className="text-gray-300 font-medium pt-4 mb-4">
                الهيئة الشرعية بمنصة زفاف
              </p>
              <p>تتمنى لكم التوفيق والسداد والرشاد.</p>

              <p className="text-center ">منصة زفاف</p>

              <p className="text-center ">خطط لزواجك بأخلاق إسلامية.</p>
            </ul>
          </div>
        </div>
      </div>
    </section>
  );
};

export default Conditions;
