// import groom from "../assets/ZEFAAF AVATAR NEW .png";

const Privacy = () => {
  return (
    <section className="py-12 mt-[140px]  bg-[#5650ce]">
      <div className="container mx-auto px-4 max-md:px-2">
        <h2 className="text-4xl font-bold text-center mb-8">سياسة الخصوصية
        </h2>

        <div className="bg-[#6610f2] flex items-center bg_image  justify-center p-8 rounded-lg shadow-lg">
          <div className="w-[100%]  max-md:w-full">
            <h4 className="text-[white] text-center mb-5 h-[50px] text-xl font-bold">مع منصة زفاف أنت آمـن

</h4>
            <ul className="list-disc px-4 mb-6 flex flex-col gap-4 text-lg text-white">
              <li className="mb-2">
                ابتداءً منصة زفاف لديها هيئة شرعية وهم نخبة من أهل العلم فاطمئن.
              </li>
              <li className="mb-2">
                إن منصة زفــــاف مسئولة عن حمايــة خصوصيتك،
              </li>
              <li className="mb-2">
                منصة زفـــاف آمنة ومحمية ضد أي اختراق داخلي أو خارجي بإذن الله.
              </li>
              <li className="mb-2">
                لجميع المستخدمين كامل الحق في إلغاء عضويتهم في أي وقت،
              </li>
              <li className="mb-2">
                كما يحق لأي عضو حذف بياناته تماماً إذا رغب فى ذلك.
              </li>
              <li className="mb-2">جميع المحادثات والمراسلات ضمن منصة زفــاف هي قيد السرية التامة.
              </li>

              <li className="mb-2">منصة زفــاف غير مسئولة إطلاقاً عن أي محتوى مسيء في الرسائل الداخلية بين المستخدمين،
ولكننا نراقب عن كثب أية مخالفات شرعية واذا ثبت لنا وجود مخالفات،
تقوم الهيئة الشرعية بمنصة زفاف بحظر وطرد المخالفين فوراً بلا رجعة.</li>
              <li className="mb-2">على جميع الأعضاء الالتزام بالأخلاق الإسلامية والتقاليد المجتمعية،
              وكذلك شروط العضوية والإبلاغ فوراً عن أية إساءة عن طريق التواصل مع الإدارة.</li>
              <li className="mb-2">احترس ولا تقم أبداً بإرسال أية هدايا أو مبالغ مالية،
بناءً على طلب الطرف الآخر أو حتى متطوعاً من نفسك،
حيث انتشرت في الآونة الأخيرة ظاهرة الاحتيال بين الجنسين.</li>
              <li className="mb-2">
منصة زفـــاف عادةً ما تقوم بفحص الرسائل الخاصة بين الأعضاء،
في حالة ورود شكوى أو تجاوز وفي غير هذه الحالة،
تبقى الرسائل سرية ولا يطلع عليها غير الإدارة فلا داعي للقلق.</li>
              <li className="mb-2">
مستخدم المنصة مسئول مسئولية كاملة عن نشاطاته وتصرفاته وردود أفعاله،
ويجب أن تكون لائقة بأخلاقه كمسلم وبالمنصة الشرعية التي هو عضو بها.</li>
              <li className="mb-2">يرجى العلم بأن جميع المعلومات والمواصفات الشخصية،
              والتي قمت بإدخالها في ملفك الشخصي ستُعلن فعليا في بياناتك الشخصية،</li>
              <li className="mb-2">احرص على ألا تعطي بياناتك مثل كلمة السر بيانات حسابك البنكي لأي شخص،
              وإدارة المنصة لن تسألك أبداً عن هذه البيانات لأنها موجودة مسبقاً لدينا.</li>
              <li className="mb-2">لفريق عمل منصة زفـــاف الحق في التواصل مع،
جميع المستخدمين المسجلين بالمنصة في أي وقت وكيفما نشاء،
بكل طرق التواصل المتاحة وكذلك إرسال إشعارات يومية،
أو رسائل إعلانية أو معلومات أو مقالات أو استشارات أسرية،
أو كل ما هو جديد من خدمات تقدمها منصة زفاف،
أو تحتوي على مجرد عروض إعلانية لزفـــاف أو لأي جهة أخرى.</li>
              <li className="mb-2">على منصة زفـــاف نتطلع دوماً لخدمتكم والارتقاء بمستوى التكنولوجيا التي نقدمها لكم,
فإذا كانت لديكم آية استفسارات أو موضوعات تهمكم،
أو مقترحات تفيدكم في تطوير منصة زفاف فلا تترددوا في التواصل معنا على:
Support@zefaaf.net
</li>

            </ul>
          </div>

          {/* <div className="w-[50%] max-md:hidden">
            <img src={groom} className="w-full h-full" alt="" />
          </div> */}
        </div>
      </div>
    </section>
  );
};

export default Privacy;
